# TopographyLinkType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographyLinkType Class
Members See Also
---
This class represents the site file brought into the current Revit document.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public class TopographyLinkType : ElementType
```

Visual Basic
---
```text
Public Class TopographyLinkType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class TopographyLinkType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Architecture..::..TopographyLinkType
# See Also
TopographyLinkType Members
Autodesk.Revit.DB.Architecture Namespace